const about = [
  {
    type: 'provider',
    title: '‣ Надёжный поставщик',
    text: 'ООО «ЭКЗАМЕН-ТЕХНОЛАБ» предоставляет большой ассортимент современных робототехнических модулей для применения в школах в рамках программ начального и среднего образования во внеклассной работе с учащимися, а также для оснащения учебных технопарков. Наши специалисты помогут подобрать необходимые робототехнические конструкторы и сопутствующие товары.',
  },
  {
    type: 'project',
    title: '‣ Образовательный проект.',
    text: 'ООО «ЭКЗАМЕН-ТЕХНОЛАБ» — образовательный проект, который позволяет в игровой форме осваивать навыки в области проектирования и программирования, развивать инженерное мышление с начальных классов.',
    children: {
      type: 'project-objective',
      title: '‣ Цель проекта.',
      text: 'Сделать доступными и понятными для учащихся технические направления образования за счёт применения в обучении простейших роботов и робототехнических устройств.',
    }
  },
  {
    type: 'competition',
    title: '‣ Соревновательная площадка.',
    text: 'ООО «ЭКЗАМЕН-ТЕХНОЛАБ» проводит соревнования по робототехнике для учеников разных уровней подготовки. В процессе участия в соревнованиях участники конструируют роботов и решают неординарные задачи, за счёт чего формируются умения работать в команде, искать и находить креативные решения. Наши сотрудники на всех этапах помогают участникам преодолеть соревновательный путь комфортно и успешно.',
  },
  {
    type: 'distributor',
    title: '‣ Авторизированный дистрибьютор.',
    text: 'ООО «ЭКЗАМЕН-ТЕХНОЛАБ» является авторизированным дистрибьютором на территории Российской Федерации, Республики Беларусь и Казахстана. Необходимую учебную литературу для учеников и преподавателей можно найти на нашем сайте.',
  },
];

export default about;