import preliminary from '../images/cards/preliminary.png';
import elementary from '../images/cards/elementary.png';
import basic from '../images/cards/basic.png';
import professional from '../images/cards/professional.png';
import research from '../images/cards/research.png';
import aero from '../images/cards/aero.png';


const cards = [
    {
        level: 'preliminary',
        img: preliminary,
        title: 'Образовательный робототехнический модуль «Предварительный уровень»',
        article: 'ТР-0152',
        price: '132 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «Предварительный уровень» содержит:',
                list: [
                    'Базовые робототехнические наборы – 5 шт.; для группового и индивидуального применения.',
                    'Методические рекомендации для преподавателя  - 1 шт; содержат теоретические аспекты по основам робототехники; рекомендации по сборке моделей.',
                    'Методические рекомендации для ученика - 5 шт.; содержат руководства по сборке 25 различных моделей на основе базового набора и поясняющие материалы.',
                ],
                note: '',
            }
        ],
        specifications: [
            {
                title: 'Набор конструктивных элементов состоит из пластиковых деталей и крепежных элементов, а так же специализированного инструмента для их сборки.',
                list: [],
                note: '',
            },
            {
                title: 'В состав модуля входит:',
                list: [
                    '629 деталей, перфорированные пластины из высококачественного пластика;',
                    '690 элементов различных комплектов заклепок для фиксированных и подвижных соединений;',
                    '20 колес и 30 эластичных резиновых жгутов.',
                ],
                note: 'Крепежные элементы позволяют реализовывать как фиксированные соединения деталей и фланцев, так и подвижные вращающиеся соединения шарниров и различных передач.',
            },
            {
                title: 'Каждый модуль содержит:',
                list: [
                    'Привод на базе двигателя постоянного тока и понижающего редуктора – 5 шт. Привод представляет собой электромеханическую сборку двигателя постоянного тока, а также редуктора. В корпусе каждого привода предусмотрен отсек для установки элементов питания типа АА.',
                    'Специализированный инструмент для сборки – 10 шт.',
                ],
                note: 'Все элементы каждого базового робототехнического набора, входящего в комплект поставки конструктивно и электрически совместимы друг с другом.',
            },
        ],
    },
    {
        level: 'elementary',
        img: elementary,
        title: 'Образовательный робототехнический модуль «Начальный уровень»',
        article: 'ТР-0241',
        price: '450 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «Начальный уровень WS» содержит:',
                list: [
                    'Супер набор (2-го поколения) – 2 шт.;',
                    'Соревновательный набор – 2 шт.;',
                    'Конструктивный набор – 1 шт.;',
                    'Мехатронный набор – 1 шт.;',
                    'Сенсор технического зрения – 1 шт.;',
                    'Методические рекомендации - 5 шт.;',
                    'Игровое поле для соревнований - 1 шт.;',
                    'Комплект соревновательных элементов - 1 шт.',
                ],
                note: '',
            },
        ],
        specifications: [
            {
                title: 'Супер набор (2-го поколения) состоит из пластиковых деталей и крепежных элементов, не требующих специализированного инструмента для сборки. В состав робототехнического набора входит:',
                list: [
                    'Контроллер управления роботом;',
                    'Пульт управления;',
                    'Аккумуляторная батарея;',
                    'Датчик расстояния;',
                    'Оптический датчик;',
                    'Электрический привод - 4 шт.',
                    'Датчик касания со светодиодной панелью;',
                    'Кабели для устройств;',
                    'Инструмент для сборки;',
                    'Коробки для хранения - 2 шт.;',
                    'Конструктивные компоненты – 1036 шт.',
                ],
                note: '',
            },
            {
                title: 'Соревновательный набор:',
                list: [
                    'Набор цепных колес и цепей;',
                    'Гусеничный набор;',
                    'Набор колес и покрышек;',
                    'Дополнительные колеса и моторы;',
                    'Колесо всенаправленного движения - 2 шт.;',
                    'Привод - 2 шт.',
                ],
                note: '',
            },
            {
                title: 'Конструктивный набор:',
                list: [
                    'Конструктивные элементы из пластика - 194 шт.;',
                    'Переходные и соединительные элементы - 312 шт.;',
                    'Крепежные элементы, представляющие собой пластиковые втулки различной длины – 320 шт.;',
                    'Валы и сопутствующие им элементы – 170 шт.;',
                    'Шкивы – 8 шт.;',
                    'Ремни – 8 шт.;',
                    'Элементы подшипниковых креплений – 15 шт.',
                ],
                note: '',
            },
            {
                title: 'Мехатронный набор:',
                list: [
                    'Расширенный комплект для создания зубчатых передач;',
                    'Комплект для создания дифференциальных передач;',
                    'Комплект для создания планетарных передач;',
                    'Комплект универсальных соединителей валов;',
                    'Омни-колеса (колеса всенаправленного движения).',
                ],
                note: '',
            },
        ],
    },
    {
        level: 'basic',
        img: basic,
        title: 'Образовательный робототехнический модуль «Базовый уровень»',
        article: 'ТР-0441А',
        price: '432 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «Базовый уровень» содержит:',
                list: [
                    'Базовые робототехнический набор – 4 шт.; для изучения базовых основ робототехники, основ программирования роботов и робототехнических устройств на базе программно-аппаратного комплекса совместимого с программируемым контроллером Arduino.',
                    'Ресурсный робототехнический набор – 4 шт.; для изучения основ электроники и микропроцессорной техники, основ программирования контроллеров  на базе программируемого контроллера Iskra Neo совместимого с контроллером Arduino.',
                    'Методические рекомендации в 2х частях - 4 шт.; содержат руководства по изучению основ программирования и сборке различных схем и моделей  базового и ресурсного наборов.',
                    'Диск с программными материалами и дополнительными заданиями - 1 шт.',
                ],
                note: 'Все содержимое образовательного робототехнического модуля помещено в пластиковый бокс с крышкой, для обеспечения сохранности при перевозке и хранении оборудования.',
            },
        ],
        specifications: [
            {
                title: 'В состав базового робототехнического набора входят следующие основные конструктивные элементы и устройства:',
                list: [
                    'Колеса с прорезиненным ободом диаметром - 4шт.',
                    'Комплект для сборки захватного устройства, включающий в себя схват манипулятора, комплект зубчатых колес, набор крепежных элементов – 1 комплект.',
                    'Комплект на базе привода постоянного тока и силового модуля для управления приводом –  2 шт.',
                    'Привод постоянного тока –  2 шт.',
                    'ИК-датчик –  3 шт.',
                    'УЗ-датчик – 1 шт. (аналогового типа, диапазон изм. от 40 мм до 2,9 м).',
                    'Аккумуляторная батарея емкостью не менее 2000 мАч –  1 шт',
                    'Программируемый контроллер –  1шт. Выполнен в  виде специализированного модуля с коммуникационными портами и разъемами, расположенными по периметру.'
                ],
                note: '',
            },
            {
                title: 'Программируемый  контроллер включает в себя:',
                list: [
                    '7 пинов с ШИМ;',
                    '1 аппаратный интерфейс UART (Serial);',
                    '1 аппаратный интерфейс TWI (I²C);',
                    '5 пинов, поддерживающих аппаратное прерывание;',
                ],
                note: '',
            },
        ],
    },
    {
        level: 'professional',
        img: professional,
        title: 'Образовательный робототехнический модуль «Профессиональный уровень»',
        article: 'ТР-0541',
        price: '432 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «Профессиональный уровень» содержит:',
                list: [
                    'Базовые робототехнические наборы – 4шт.; для группового и индивидуального применения.',
                    'Методические рекомендации для преподавателя  - 1шт; содержат теоретические аспекты по основам робототехники; рекомендации по сборке моделей.',
                    'Методические рекомендации для ученика - 4шт.; содержат руководства по сборке 10 различных моделей.',
                    'Оптический диск с лицензионным ПО - 1шт.; для программирования управляющего контроллера.',
                    'Оптический диск с инструкциями и рабочими материалами - 1шт.',
                    'Комплект модулей Bluetooth для беспроводной передачи данных-1 шт. (комплект состоит из 2х устройств).',
                    'Комплект модулей ZigBee для беспроводной передачи данных - 2шт. (комплект состоит из 3х устройств).',
                    'Модуль USB для преобразования интерфейсов - 2шт. Для интерфейсов TTL, RS-232 и RS-485 в последовательный интерфейс.',
                ],
                note: '',
            },
        ],
        specifications: [
            {
                title: 'Базовый робототехнический набор состоит из пластиковых деталей и крепежных элементов, а так же специализированного инструмента для их сборки.',
                list: [],
                note: '',
            },
            {
                title: 'Состав базового комплекта содержит:',
                list: [
                    '81 детали, представляющих собой перфорированные пластины из прочного пластика;',
                    '30 элементов различных подвижных передач и шарниров;',
                    '53 детали, представляющих собой конструктивные элементы и переходные фланцы между компонентами набора;',
                    '102 детали, представляющие собой компоненты для сборки гусеничных траков; пассивная опора – 1шт;',
                    '10 зубчатых колес;',
                    '2 резиновых колес с дисками из прочного пластика;',
                    '14 шкивов и 6 фланцев.',
                ],
                note: '',
            },
            {
                title: 'Крепежные элементы представляют собой:',
                list: [
                    'комплект винтов различной длины в кол-ве 135 шт;',
                    'комплект специализированных крепежных элементов в кол-ве 230 шт, представляющих собой пластиковые втулки и заклепки.',
                ],
                note: 'Крепежные элементы позволяют реализовывать как фиксированные соединения деталей и фланцев, так и подвижные вращающиеся соединения',
            },
            {
                title: 'Набор содержит следующие основные элементы:',
                list: [
                    'Сервопривод на базе двигателя постоянного тока и понижающего редуктора - 2шт. Привод представляет собой электромеханическую сборку двигателя постоянного тока, а так же редуктора. Сервопривод обладает сетевым интерфейсом для управления посредством цифровых пакетов и возвращения параметров обратной связи по шине TTL.',
                    'ИК – датчик - 3шт. ИК-сенсор с аналоговым выходом для выдачи результатов измерений.',
                    'Массив ИК-сенсоров - 1шт.  Устройство представляет единый модуль с общим кол-во ИК сенсоров 7шт. В состав устройства входит динамик, воспроизводящий звуки различной нотной тональности. Устройство обладает сетевым интерфейсом для управления посредством цифровых пакетов и возвращения параметров обратной связи по шине TTL.',
                    'Интерфейсный кабель USB – 1шт., для программирования управляющего контроллера.',
                    'Комплект шлейфов – 1шт., для соединения элементов базового робототехнического набора. - Отсек для установки источника питания типа АА – 6шт.',
                    'Управляющий контроллер – 1шт. Управляющий контроллер представляет собой блок управления конструктивно и электрически совместимый со всеми элементами базового набора.  Напряжение питания контроллера находится в диапазоне 6-15В.  На корпусе контроллера  установлены 6 кнопок, 6 индикационных светодиодов, а так же переключатель питания управляющего контроллера. Внутри корпуса контроллера расположен микрофон для детектирования внешних звуков, а так же датчик уровня бортового питания. Контроллер содержит: 6 портов для подключения внешних цифровых и аналоговых устройств, 5 портов для подключения устройств по шине TTL.',
                ],
                note: 'Все элементы каждого базового робототехнического набора, входящего в комплект поставки конструктивно и электрически совместимы друг с другом.',
            },
        ],
    },
    {
        level: 'research',
        img: research,
        title: 'Образовательный робототехнический модуль «Исследовательский уровень»',
        article: 'ТР-0621',
        price: '396 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «Исследовательский уровень» содержит:',
                list: [
                    'Базовый робототехнический набор – 1шт.; для применения в образовательном процессе и исследованиях.',
                    'Ресурсный робототехнический набор – 1шт.; для применения в специализированных соревнованиях.',
                    'Методические рекомендации для преподавателя  - 1шт.',
                    'Методические рекомендации для ученика - 1шт.',
                    'Оптический диск с лицензионным ПО - 1шт.; для программирования управляющего контроллера.',
                    'Оптический диск с инструкциями и рабочими материалами - 1шт.',
                ],
                note: 'Содержит программное обеспечение для настройки, калибровки и управления универсальным модулем на базе CMOS камеры, инструкции, методические рекомендации. Содержит инструкции по управлению подвижными моделями роботов с помощью мультимедийных устройств  на базе ОС Android посредством канала связи на базе интерфейса Bluetooth.',
            },
        ],
        specifications: [
            {
                title: 'Базовый робототехнический набор состоит из пластиковых деталей и крепежных элементов, а так же специализированного инструмента для их сборки.',
                list: [],
                note: '',
            },
            {
                title: 'В состав базового комплекта входит:',
                list: [
                    '120 деталей, представляющих собой различные пластины и скобы из качественного пластика;',
                    'корпусные элементы из прозрачного пластика 4шт;',
                    'различные втулки в кол-ве 60шт для реализации фиксированных и подвижных соединений;',
                    'фиксирующие скобы для кабелей и шлейфов в кол-ве 20шт;',
                    'комплект втулок и заклепок в кол-ве 28шт.',
                ],
                note: '',
            },
            {
                title: 'Крепежные элементы представляют собой:',
                list: [
                    'комплект винтов и шурупов различной длины в кол-ве 640шт;',
                    'комплект гаек различного размера в кол-ве 410шт.',
                ],
                note: '',
            },
            {
                title: 'Набор содержит следующие основные элементы:',
                list: [
                    'Сервопривод на базе двигателя постоянного тока и понижающего редуктора -  18шт. Сервопривод обладает сетевым интерфейсом для управления посредством цифровых пакетов и возвращения параметров обратной связи по шине TTL.',
                    'ИК – датчик - 2шт., обладает аналоговым выходом для выдачи результатов измерений, ИК – дальномер -  1шт.',
                    'Двухосевой гироскоп – 1шт. Датчик с аналоговым выходом для возврата результата измерений.',
                    'Пульт дистанционного управления – 1шт. Пульт представляет собой ИК-джойстик с  программируемыми кнопками в кол-ве 10 шт. Питание пульта осуществляется от аккумуляторов типа АА. Конструкция пульта предусматривает возможность замены ИК-модуля передачи данных на модуль типа ZigBee или Bluetooth.',
                    'ИК-передатчик - 1шт. Устройство предназначено для подключения к управляющему контроллеру и приема сигналов от пульта дистанционного управления.',
                    'Управляющий контроллер – 1шт. Управляющий контроллер представляет собой блок управления конструктивно и электрически совместимый со всеми элементами базового набора. Внутри корпуса контроллера расположен микрофон, а так же датчик уровня бортового питания. Контроллер содержит: 6 портов для подключения внешних цифровых устройств, 5 портов для подключения устройств по TTL.',
                    'Комплект модулей ZigBee - 1шт., для беспроводной передачи данных. Каждый комплект состоит из 3х устройств, позволяющих организовать передачу данных между элементами базового набора и персональным компьютером.',
                    'Модуль USB для преобразования интерфейсов в кол-ве 1шт. Модуль обеспечивает преобразование интерфейсов TTL,RS-232,RS-485 в последовательный интерфейс персонального компьютера.',
                    'Универсальный сенсорный модуль - 1шт. Устройство содержит: 3 ИК-сенсора, позволяющих измерять дальность до объекта или яркость поверхности; ИК-порт; микрофон; динамик; датчик температуры. Управление устройством и считывание показание сенсорных устройств осуществляется по шине TTL.',
                    'Универсальный модуль на базе CMOS камеры - 1шт. Устройство обладает последовательным коммуникационным интерфейсом для подключения к управляющему контроллеру.',
                    'Аккумуляторная батарея (LiPo) – 1шт. Аккумуляторная батарея установлена в пластиковом корпусе, совместимым с  корпусными элементами и деталями комплекта.',
                    'Адаптер для зарядки аккумуляторной батареи от сети 220В. – 1шт.',
                    'Комплект сетевых кабелей -1шт.,  для зарядки аккумуляторной батареи.',
                    'USB  интерфейсный кабель для программирования базового набора – 1шт',
                ],
                note: '',
            },
            {
                title: 'Ресурсный робототехнический набор состоит из пластиковых деталей и крепежных элементов, а так же специализированного инструмента для их сборки.',
                list: [
                ],
                note: '',
            },
            {
                title: 'Ресурсный робототехнический набор содержит:',
                list: [
                    '81 детали, представляющих собой перфорированные пластины из прочного пластика;',
                    '30 элементов различных подвижных передач и шарниров;',
                    '53 детали, представляющих собой конструктивные элементы и переходные фланцы между   различными компонентами набора;',
                    '102 детали, представляющие собой компоненты для сборки гусеничных траков;',
                    'пассивная опора – 1шт;',
                    '10 зубчатых колес;',
                    '2 резиновых колес с дисками из качественного пластика;',
                    '14 шкивов и 6 круглых фланцев.',
                ],
                note: 'Крепежные элементы представляют собой:  комплект винтов различной длины в кол-ве 135 шт; комплект специализированных крепежных элементов в кол-ве 230 шт, представляющих собой пластиковые втулки и заклепки. Крепежные элементы позволяют реализовывать как фиксированные соединения деталей и фланцев, так и подвижные вращающиеся соединения шарниров и различных передач.',
            },
            {
                title: 'Набор содержит следующие основные элементы:',
                list: [
                    'Сервопривод на базе двигателя постоянного тока и понижающего редуктора - 2шт. Привод представляет собой электромеханическую сборку двигателя постоянного тока, а так же редуктора.  Сервопривод обладает сетевым интерфейсом для управления посредством цифровых пакетов и возвращения параметров обратной связи по шине TTL.',
                    'ИК – датчик - 3шт. ИК-сенсор обладает аналоговым выходом для выдачи результатов измерений.',
                    'Массив ИК-сенсоров - 1шт.  Устройство представляет единый модуль с общим кол-во ИК сенсоров 7шт. В состав устройства  входит динамик, воспроизводящий звуки различной нотной тональности. Устройство обладает сетевым интерфейсом для управления посредством цифровых пакетов и возвращения параметров обратной связи по шине TTL.',
                    'Интерфейсный кабель USB – 1шт., для программирования управляющего контроллера.',
                    'Комплект шлейфов – 1шт., для соединения основных элементов базового робототехнического набора.',
                    'Отсек для установки источника питания типа АА – 6шт.',
                    'Управляющий контроллер – 1шт. Управляющий контроллер представляет собой блок управления конструктивно и электрически совместимый со всеми элементами базового набора.  микрофон для детектирования внешних звуков, а так же датчик уровня бортового питания. Контроллер содержит: 6 портов для подключения внешних цифровых и аналоговых устройств, 5 портов для подключения устройств по шине TTL.',
                ],
                note: 'Все элементы каждого базового робототехнического набора, входящего в комплект поставки  конструктивно и электрически совместимы друг с другом.',
            },
        ],
    },
    {
        level: 'aero',
        img: aero,
        title: 'Образовательный робототехнический модуль «Аэро»',
        article: 'ТР-0841',
        price: '540 000',
        kit: [
            {
                title: 'Образовательный робототехнический модуль «АЭРО. Спортивный» (ТА-0842) содержит в своём составе:',
                list: [
                    'Готовые к полёту квадрокоптеры;',
                    'FPV системы для полёта от первого лица;',
                    'Зарядные станции;',
                    'Расходные и запасные материалы;',
                    'Комплект трассы для построения маршрутов для соревнований и практических занятий;',
                    'Беспроводную система учета времени для каждого дрона;',
                    ' Методическое пособие.',
                ],
                note: '',
            },
            {
                title: 'Образовательный робототехнический модуль «АЭРО. Программирование» (ТА-0843) содержит в своём составе:',
                list: [
                    'Готовые к полёту квадрокоптеры;',
                    'Системы коммутации квадрокоптеров;',
                    'Система навигации квадрокоптеров;',
                    'Зарядные станции;',
                    'Расходные и запасные материалы;',
                    'Методическое пособие.',
                ],
                note: '',
            },
        ],
        specifications: [
            {
                title: 'Раздел дополняется',
                list: [],
                note: '',
            },
        ],
    },
]

export default cards;