export const texts = {
    'about': <>
        <p className="text"> <b>ООО &laquo;Экзамен-Технолаб&raquo; &mdash;</b>&thinsp; один из&nbsp;ведущих российски
            разработчиков и&nbsp;поставщиков комплексных решений в&nbsp;сфере образования.</p>
        <p className="text">Образовательные робототехнические модули предназначены для освоения базовых навыков в&nbsp;области проектирования  различных объектов, направлены на&nbsp;развитие у&nbsp;учащихся любознательности и&nbsp;интереса к&nbsp;технике для освоения  начальных навыков в&nbsp;области проектирования и&nbsp;программирования простейших роботов и&nbsp;робототехнических устройств.</p>
        <p className="text">Каждый модуль&nbsp;&mdash; это продукт, разработанный специально для учебных целей, и&nbsp;предназначенный в&nbsp;первую очередь для применения в&nbsp;рамках программ начального и&nbsp;среднего образования во&nbsp;внеклассной работе с&nbsp;учащимися, а&nbsp;также для оснащения учебных технопарков.</p>
        <p className="text">Образовательные робототехнические модули наглядно демонстрируют различные междисциплинарные основы робототехники, механики информационных систем и&nbsp;устройств, разработки алгоритмов и&nbsp;программного обеспечения.</p>
        <p className="text">В&nbsp;состав модулей входят: наборы образовательны материалов и&nbsp;методик, специально адаптированное программное обеспечение, всевозможны конструкционные и&nbsp;соединительные элементы, привода, программируемые контроллеры, сенсорные устройства, датчики и&nbsp;многое другое.</p>
    </>,

    'contacts': <>
        <p className="text"> <b>ООО &laquo;ЭКЗАМЕН-ТЕХНОЛАБ&raquo;</b></p>
        <p className="text"> Авторизованный дистрибьютор на&nbsp;территории
            Российской Федерации, Республики Беларусь и&nbsp;Казахстана</p>
        <p className="text"><b>Адрес:</b> Россия, 107045, г. Москва Луков переулок, дом 8.</p>
        <p className="text"><b>Тел.&nbsp;</b>+7 (495) 641-00-23</p>
        <p className="text"><b>Связаться с&nbsp;нами&nbsp;Вы можете:</b></p>
        <p className="text">Для заказа продукции
            zakaz@examen-technolab.ru</p>
        <p className="text">по&nbsp;вопросам тех. поддержки
            support@examen-technolab.ru</p>
    </>,

    'main': <>
        <p className="text"> <b>Образовательные робототехнические модули</b> предназначены для освоения базовых навыков в&nbsp;области проектирования различных объектов, направлены на&nbsp;развитие у&nbsp;учащихся любознательности и&nbsp;интереса к&nbsp;технике, для освоения начальных навыков в&nbsp;области проектирования и программирования простейших роботов и&nbsp;робототехнических устройств.</p>
        <p className="text"><b>ООО &laquo;Экзамен-Технолаб&raquo;</b> предлагает Вашему вниманию новый образовательный продукт&nbsp;&mdash; набор специализированных образовательных робототехнических модулей для учебных классов изучения основ робототехники.</p>
        <p className="text"><b>Каждый модуль&nbsp;&mdash;</b> это продукт, разработанный специально для учебных целей, и&nbsp;предназначенный в&nbsp;первую очередь для применения в&nbsp;рамках программ начального и&nbsp;среднего образования во&nbsp;внеклассной работе с&nbsp;учащимися, а&nbsp;также для оснащения учебных технопарков.</p>
    </>,

    'preliminary': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;Предварительный уровень&raquo; </b>Способствует освоению базовых навыков в&nbsp;области проектирования и&nbsp;моделирования объектов, направлен на&nbsp;стимулирование и&nbsp;развитие любознательности и&nbsp;интереса к&nbsp;технике.</p>
        <p className="text">Модуль способствует развитию системы универсальных учебных действий в&nbsp;составе личностных, регулятивных, познавательных и&nbsp;коммуникативных действий и&nbsp;предназначается для проведения занятий в&nbsp;группах детей дошкольного возраста и&nbsp;младшего школьного возраста.</p>
    </>,

    'elementary': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;НАЧАЛЬНЫЙ УРОВЕНЬ WS&raquo; </b>Способствует освоению базовых навыков в&nbsp;области проектирования и&nbsp;моделирования объектов, у&nbsp;детей младшего школьного возраста (начальная школа).</p>
        <p className="text">Модуль способствует развитию системы универсальных учебных действий в&nbsp;составе личностных, регулятивных, познавательных и&nbsp;коммуникативных действий.</p>
        <p className="text">Модуль предназначен для проведения урочных и дополнительных занятий по изучению основ робототехники и информатики.</p>
        <p className="text"><b>Артикул: ТВ-0241</b></p>
        <p className="text"><b>9-12 Лет</b></p>
    </>,

    'basic': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;Базовый уровень&raquo; </b>представляет собой открытую платформу для создания робототехнических комплексов для образовательной, соревновательной и&nbsp;исследовательской деятельности.</p>
        <p className="text">Модуль оснащён программируемым контроллером, представляющим собой открытую программно-аппаратную платформу, преемственную с&nbsp;программируемыми контроллерами типа Arduino.</p>
        <p className="text">Модуль «Базовый уровень» может применяться на стыке двух направлений образовательной деятельности учащихся — ​реализации творческих инженерных проектов на базе программно-аппаратных платформ открытого типа, а так же создании робототехнических комплексов для задач образовательного и соревновательного характера.</p>
        <p className="text"><b>Артикул: ТВ-0441A</b></p>
        <p className="text"><b>12-15 Лет</b></p>
    </>,

    'professional': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;ПРОФЕССИОНАЛЬНЫЙ уровень&raquo; </b>способствует освоению навыков в&nbsp;области проектирования и&nbsp;моделирования объектов с&nbsp;целью их&nbsp;использования для исследования явлений и&nbsp;процессов, формированию логического мышления и&nbsp;выявления причинно-следственных связей, а&nbsp;так&nbsp;же формирование навыков инженерно-технического программирования.</p>
        <p className="text">Обеспечивает решение образовательных задач участников образовательного процесса (обучающийся, педагог) с использованием информационно-коммуникационных технологий (ИКТ).</p>
        <p className="text">Модуль предназначен для проведения занятий в&nbsp;классах углубленного изучения робототехники, а&nbsp;так&nbsp;же в&nbsp;рамках изучения информатики и&nbsp;досугового образования.</p>
        <p className="text"><b>Артикул: ТР-0541</b></p>
        <p className="text"><b>14+&nbsp;Лет</b></p>
    </>,

    'research': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;ИССЛЕДОВАТЕЛЬСКИЙ уровень&raquo; </b>способствует развитию системы универсальных учебных действий в&nbsp;составе личностных, регулятивных, познавательных и&nbsp;коммуникативных действий в&nbsp;т.&nbsp;ч.&nbsp;с использованием информационно-коммуникационных технологий (ИКТ).</p>
        <p className="text">Модуль предназначен для проведения занятий в&nbsp;классах углубленного изучения робототехники, а&nbsp;так&nbsp;же в&nbsp;рамках изучения информатики и&nbsp;досугового образования.</p>
        <p className="text">Программно и&nbsp;конструктивно совместим с&nbsp;модулем &laquo;Профессиональный уровень&raquo;.</p>
        <p className="text"><b>Артикул: ТР-0621</b></p>
        <p className="text"><b>14+&nbsp;Лет</b></p>
    </>,

    'aero': <>
        <p className="text"><b>Образовательный робототехнический модуль &laquo;АЭРО&raquo;</b></p>
        <p className="text">Образовательный набор по&nbsp;конструированию, программированию и&nbsp;пилотированию беспилотного летательного аппарата.</p>
        <p className="text">Аэромодуль это комплексное решение, с&nbsp;помощью которого учащиеся научатся собирать и&nbsp;программировать БПЛА, а&nbsp;также выбирать и&nbsp;применять подходящие технологии для решения практических задач с&nbsp;помощью квадрокоптера.</p>
        <p className="text"><b>Артикул: ТА-0841, ТА-0842, ТА-0843</b></p>
        <p className="text"><b>12-15 Лет</b></p>
    </>,
}

export default texts;